/*****************************************************************************
File name: TDT_Task\src\cylce.h
Description: ÓÃÓÚ¼ì²âÁ½´Îµ÷ÓÃÖ®¼äµÄÊ±¼ä
Author: ×æ´«
Version: 1.1.1.191112_alpha
Date: 19.11.12
History: 
	¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª
	19.11.16 ¸ÄÐ´Get_Cycle_Tº¯Êý£¬Ê¡ÂÔ³õÊ¼»¯ºó£¬µÚÒ»´Îµ÷ÓÃ·µ»ØÖµÎªÁã£¬ÐÞ¸ÄÈë²Î
	¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª
	19.11.12 Ê×´Î¼ÇÂ¼
	¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª
*****************************************************************************/
#ifndef _CYCLE_H_
#define _CYCLE_H_

#include "sys.h"
	 
class Cycle{
private:
	float cycleTime[3];
public:
	Cycle()
	{
		cycleTime[0]=0;
		cycleTime[1]=0;
		cycleTime[2]=0;
		getCycleT();	//Éè¶¨¿ªÊ¼Ê±¼ä
	}
	float getCycleT();
};



#endif
